# Library

In [1]:
# Common Library
import pandas as pd
import numpy as np

# Library Dataset "titanic"
import seaborn as sns

# Load Dataset

In [2]:
titanic = pd.DataFrame()
titanic = sns.load_dataset("titanic") # Load titanic dataset from seaborn library
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Mean

In [3]:
# Mean from age
titanic['age'].mean()

29.69911764705882

In [4]:
# Mean fare
titanic['fare'].mean()

32.204207968574636

# Median

In [5]:
# Median from age
titanic['age'].median()

28.0

In [6]:
# Median fare
titanic['fare'].median()

14.4542

# Sum of Value

In [7]:
# Sum of value from age
titanic['age'].sum()

21205.17

In [8]:
# Sum of value fare
titanic['fare'].sum()

28693.9493

# Count number of non-null observations

In [9]:
# Count number of non-null observations age
titanic['age'].count()

714

In [10]:
# Count number of non-null observations fare
titanic['fare'].count()

891

# Mode

In [11]:
# Mode age
titanic['age'].mode()

0    24.0
Name: age, dtype: float64

In [12]:
# Mode fare
titanic['fare'].mode()

0    8.05
Name: fare, dtype: float64

In [13]:
# Mode alive
titanic['alive'].mode()

0    no
Name: alive, dtype: object

# Standard Deviation

In [14]:
# Standard deviation age
titanic['age'].std()

14.526497332334042

In [15]:
# Standard deviation fare
titanic['fare'].std()

49.6934285971809

# Minimum Values

In [16]:
# Minimum values age
titanic['age'].min()

0.42

See we have noisy data ^

In [17]:
# Minimum values fare
titanic['fare'].min()

0.0

# Maximum Value

In [18]:
# Maximum values age
titanic['age'].max()

80.0

In [19]:
# Maximum values fare
titanic['fare'].max()

512.3292

# Numerical Summary

In [20]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

# Categorical Summary

In [25]:
titanic.describe(include="object")
#

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549